export const Lorem = `대한민국의 경제질서는 개인과 기업의 경제상의 자유와 창의를 존중함을 기본으로 한다. 대통령은 헌법과 법률이 정하는 바에 의하여 공무원을 임면한다.

모든 국민은 주거의 자유를 침해받지 아니한다. 주거에 대한 압수나 수색을 할 때에는 검사의 신청에 의하여 법관이 발부한 영장을 제시하여야 한다. 국무위원은 국정에 관하여 대통령을 보좌하며, 국무회의의 구성원으로서 국정을 심의한다.

재판의 전심절차로서 행정심판을 할 수 있다. 행정심판의 절차는 법률로 정하되, 사법절차가 준용되어야 한다. 한 회계연도를 넘어 계속하여 지출할 필요가 있을 때에는 정부는 연한을 정하여 계속비로서 국회의 의결을 얻어야 한다.

국가는 재해를 예방하고 그 위험으로부터 국민을 보호하기 위하여 노력하여야 한다. 국채를 모집하거나 예산외에 국가의 부담이 될 계약을 체결하려 할 때에는 정부는 미리 국회의 의결을 얻어야 한다.

정당은 그 목적·조직과 활동이 민주적이어야 하며, 국민의 정치적 의사형성에 참여하는데 필요한 조직을 가져야 한다. 대통령의 임기연장 또는 중임변경을 위한 헌법개정은 그 헌법개정 제안 당시의 대통령에 대하여는 효력이 없다.

대통령의 국법상 행위는 문서로써 하며, 이 문서에는 국무총리와 관계 국무위원이 부서한다. 군사에 관한 것도 또한 같다. 농업생산성의 제고와 농지의 합리적인 이용을 위하거나 불가피한 사정으로 발생하는 농지의 임대차와 위탁경영은 법률이 정하는 바에 의하여 인정된다.

행정각부의 설치·조직과 직무범위는 법률로 정한다. 제1항의 지시를 받은 당해 행정기관은 이에 응하여야 한다. 정당은 법률이 정하는 바에 의하여 국가의 보호를 받으며, 국가는 법률이 정하는 바에 의하여 정당운영에 필요한 자금을 보조할 수 있다.

재산권의 행사는 공공복리에 적합하도록 하여야 한다. 국회의원은 국가이익을 우선하여 양심에 따라 직무를 행한다. 국가원로자문회의의 조직·직무범위 기타 필요한 사항은 법률로 정한다.

모든 국민은 법률이 정하는 바에 의하여 국가기관에 문서로 청원할 권리를 가진다. 국회는 헌법 또는 법률에 특별한 규정이 없는 한 재적의원 과반수의 출석과 출석의원 과반수의 찬성으로 의결한다. 가부동수인 때에는 부결된 것으로 본다.

법률이 헌법에 위반되는 여부가 재판의 전제가 된 경우에는 법원은 헌법재판소에 제청하여 그 심판에 의하여 재판한다. 이 헌법은 1988년 2월 25일부터 시행한다. 다만, 이 헌법을 시행하기 위하여 필요한 법률의 제정·개정과 이 헌법에 의한 대통령 및 국회의원의 선거 기타 이 헌법시행에 관한 준비는 이 헌법시행 전에 할 수 있다.

법관이 중대한 심신상의 장해로 직무를 수행할 수 없을 때에는 법률이 정하는 바에 의하여 퇴직하게 할 수 있다. 국가는 균형있는 국민경제의 성장 및 안정과 적정한 소득의 분배를 유지하고, 시장의 지배와 경제력의 남용을 방지하며, 경제주체간의 조화를 통한 경제의 민주화를 위하여 경제에 관한 규제와 조정을 할 수 있다.

모든 국민은 자기의 행위가 아닌 친족의 행위로 인하여 불이익한 처우를 받지 아니한다. 국무총리는 국무위원의 해임을 대통령에게 건의할 수 있다. 대한민국의 국민이 되는 요건은 법률로 정한다.

헌법에 의하여 체결·공포된 조약과 일반적으로 승인된 국제법규는 국내법과 같은 효력을 가진다. 국회는 국민의 보통·평등·직접·비밀선거에 의하여 선출된 국회의원으로 구성한다.

통신·방송의 시설기준과 신문의 기능을 보장하기 위하여 필요한 사항은 법률로 정한다. 국가의 세입·세출의 결산, 국가 및 법률이 정한 단체의 회계검사와 행정기관 및 공무원의 직무에 관한 감찰을 하기 위하여 대통령 소속하에 감사원을 둔다.

타인의 범죄행위로 인하여 생명·신체에 대한 피해를 받은 국민은 법률이 정하는 바에 의하여 국가로부터 구조를 받을 수 있다. 근로조건의 기준은 인간의 존엄성을 보장하도록 법률로 정한다.

국회의 회의는 공개한다. 다만, 출석의원 과반수의 찬성이 있거나 의장이 국가의 안전보장을 위하여 필요하다고 인정할 때에는 공개하지 아니할 수 있다.

혼인과 가족생활은 개인의 존엄과 양성의 평등을 기초로 성립되고 유지되어야 하며, 국가는 이를 보장한다. 이 헌법시행 당시의 법령과 조약은 이 헌법에 위배되지 아니하는 한 그 효력을 지속한다.

모든 국민은 그 보호하는 자녀에게 적어도 초등교육과 법률이 정하는 교육을 받게 할 의무를 진다. 대통령은 법률이 정하는 바에 의하여 훈장 기타의 영전을 수여한다.

의원을 제명하려면 국회재적의원 3분의 2 이상의 찬성이 있어야 한다. 원장은 국회의 동의를 얻어 대통령이 임명하고, 그 임기는 4년으로 하며, 1차에 한하여 중임할 수 있다.

국정의 중요한 사항에 관한 대통령의 자문에 응하기 위하여 국가원로로 구성되는 국가원로자문회의를 둘 수 있다. 모든 국민은 법률이 정하는 바에 의하여 납세의 의무를 진다. `;

export function TestPageText() {
  const text = `옵티미스틱 응답(Optimistic Response)을 사용하여 사용자 인터페이스를 보다 반응적으로 만드는 것은 훌륭한 방법입니다. 이 기법은 특히 소셜 미디어 플랫폼에서 팔로우와 언팔로우 같은 액션에 적용할 때 유용합니다.
  \n\n
  팔로우와 언팔로우 로직 통합하기 \n
  팔로우와 언팔로우 로직을 통합할 때, 중요한 것은 두 상태 간의 전환을 명확하게 관리하는 것입니다. 여기서는 React와 상태 관리 라이브러리(예: Redux, MobX, React Context)를 사용하는 예시로 설명하겠습니다.
  \n\n
  1. 상태 정의 \n
  우선, 사용자의 팔로우 상태를 관리할 상태 변수가 필요합니다. 이 변수는 팔로우 중인지 아닌지를 나타내는 boolean 값이 될 수 있습니다.
  \n\n
  2. 액션 핸들러 구현 \n
  사용자가 버튼 클릭(예: 팔로우 버튼)을 통해 액션을 취할 때 호출될 핸들러 함수를 구현합니다. \n
  \n
  3. UI 컴포넌트 구현\n
  UI에서는 isFollowing 상태에 따라 다른 텍스트나 스타일을 보여줄 수 있습니다.\n
  \n\n
  고려 사항\n\n
  옵티미스틱 업데이트 롤백: 서버 요청이 실패했을 때 사용자에게 적절한 피드백을 제공하고, 상태를 이전 상태로 롤백할 수 있어야 합니다.\n
  동시성 이슈: 여러 클라이언트에서 동시에 팔로우 상태를 변경할 경우를 고려해야 합니다.\n
  성능 최적화: 옵티미스틱 업데이트는 일반적으로 클라이언트 측의 성능을 크게 개선하지만, 네트워크 상태가 좋지 않거나 서버 응답이 지연되는 경우 사용자 경험에 영향을 줄 수 있습니다.`;

  const splitText = text.split("\n").map((item, key) => {
    return (
      <span key={key}>
        {item}
        <br />
      </span>
    );
  });

  return splitText;
}
